app/Http/Controllers/back/GameController.php

    public function list() {
        $g = Game::with('image')->get();
---
select * from `games`
select * from `images` where `images`.`game_id` in (3, 4)

    public function addStore(Request $req) {

        $req->validate([
            'name' => 'required|max:255',
            'image' => 'required|mimes:png,jpg,jpeg|max:2048',
            'tag'  =>  'required'
        ]);

        if($req->file() && $req->name) {
            $req->file('image')->store('public/ws');
            $path = $req->file('image')->hashName();
            $img = new Image([
                'user_id'   => Auth::id(),
                'path'      => $path,
            ]);
            $img->save();
            $image = Image::where('path', $path)->first();

            $game = new Game([
                'user_id'   => Auth::id(),
                'name'      => $req->name,
                'slug'      => slug_formater($req->name),
                'image_id'  => $image->id,
            ]);
            $game->save();

            $i = Game::where('image_id', $image->id)->first();
            $image->game_id = $i->id;
            $image->save();
---
insert into `images` (`user_id`, `path`, `updated_at`, `created_at`) values (1, 'ddJcmOaFi2dztpwKGnlCr10kZe0PPdyRbS28Z6FX.png', '2021-11-29 15:16:32', '2021-11-29 15:16:32')
select * from `images` where `path` = 'ddJcmOaFi2dztpwKGnlCr10kZe0PPdyRbS28Z6FX.png' limit 1
insert into `games` (`user_id`, `name`, `slug`, `image_id`, `updated_at`, `created_at`) values (1, 'Minecraft', 'minecraft', 1, '2021-11-29 15:16:32', '2021-11-29 15:16:32')
select * from `games` where `image_id` = 1 limit 1
update `images` set `game_id` = 1, `images`.`updated_at` = '2021-11-29 15:16:32' where `id` = 1